SM_для_EDT/src/Documents/vftАнализСУБ/vftАнализСУБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>vftАнализСУБ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКапитана</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветКомпании</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодИсполненияОбязанностейС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодИсполненияОбязанностейПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяЭффективностьСудовойСУБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийЭффективностьСудовойСУБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Предложения</name>
    <attributes>
      <name>Суб</name>
      <type>
        <types>CatalogRef.vftСУБ</types>
      </type>
    </attributes>
    <attributes>
      <name>НетПредложения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Предложение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветКомпании</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственноеПодразделение</name>
      <type>
        <types>CatalogRef.vftПодразделенияКомпании</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Documents/vftАнализСУБ/Forms/ФормаДокумента/Module.bsl
#Область События_формы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	vftОбщиеПроцедурыДокументовСервер.ПриСозданииНаСервере(Отказ,Объект);
	
	vftОбщиеПроцедурыДокументовСервер.УстановитьКнопкиИзмененияСтатуса(ЭтаФорма,Элементы.ПодменюСтатус,Объект.Статус);	

	vftОбщиеПроцедурыДокументовСервер.УстановитьДоступностьЭлементовФормы(ЭтаФорма);
	
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел() = Неопределено;
	
	ЭтаФорма.ТолькоПросмотр =  НЕ vftОбщиеПроцедурыДокументовСервер.ПолучитьВозможностьРедактироватьФормуПоСтатусу(Объект.Статус);

	
	Если  НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		ЗаполнитьСУБ();		
	КонецЕсли;
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьФлажкиОтветов();
	Если Объект.Предложения.Количество() <> 0 Тогда
		Элементы.Предложения.ТекущаяСтрока = 0;
	КонецЕсли;
	
	УстановитьДоступностьРеквизитов();

	
КонецПроцедуры

// ++ rarus Камаев П.В. 22.12.2020 Задача № 26135
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьСписокЖурналДокументов",,ПолучитьФорму("ОбщаяФорма.vftЖурналДокументов")); 
КонецПроцедуры
// -- rarus Камаев П.В. 22.12.2020
#КонецОбласти 

#Область События_Элементов_формы
&НаСервере
ПРоцедура ПредложенияПриАктивизацииСтрокиСервер()
	
	ТекСтрока = Элементы.Предложения.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		
		Элементы.Предложение.ПутьКДанным				= "Объект.Предложения[" + ТекСтрока + "].Предложение";
		Элементы.ОтветКомпанииНаПредложение.ПутьКДанным = "Объект.Предложения[" + ТекСтрока + "].ОтветКомпании";  
		
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветКомпанииНаПредложениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Предложения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено  Тогда
		ТекущиеДанные.ответственный = ТекущийПользователь;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Предложения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено  Тогда
		ТекущиеДанные.ЕстьОтвет = ?(ЗначениеЗаполнено(ТекущиеДанные.ОтветКомпании),2,0);
		ТекущиеДанные.ЕстьПредложение 	= ?(ЗначениеЗаполнено(ТекущиеДанные.Предложение),2,0);

	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура НетПредложенияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Предложения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если  ТекущиеДанные.НетПредложения Тогда
			Элементы.Предложения.ТекущиеДанные.Предложение = "";
		КонецЕсли; 
		ТекущиеДанные.ЕстьПредложение 	= ?(ЗначениеЗаполнено(ТекущиеДанные.Предложение),2,0);
		ТекущиеДанные.ЕстьОтвет 		= ?(ЗначениеЗаполнено(ТекущиеДанные.ОтветКомпании),2,0);

	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Предложения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено  Тогда
		
		ТекущиеДанные.ЕстьПредложение 	= ?(ЗначениеЗаполнено(ТекущиеДанные.Предложение),2,0);
		ТекущиеДанные.НетПредложения 	= ?(ЗначениеЗаполнено(ТекущиеДанные.Предложение),Ложь,Истина);
		ТекущиеДанные.ЕстьОтвет 		= ?(ЗначениеЗаполнено(ТекущиеДанные.ОтветКомпании),2,0);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтветКомпанииПриИзменении(Элемент)
	Объект.Ответственный = ТекущийПользователь;
КонецПроцедуры

#КонецОбласти 

#Область Служебные

&НаСервере
Процедура ЗаполнитьСУБ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	vftСУБ.Ссылка КАК Суб
	|ИЗ
	|	Справочник.vftСУБ КАК vftСУБ
	|ГДЕ
	|	vftСУБ.Архивный = ЛОЖЬ
	|	И vftСУБ.ПометкаУдаления = ЛОЖЬ";
	
	Объект.Предложения.Загрузить(Запрос.Выполнить().Выгрузить())
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФлажкиОтветов()
	
	Для Каждого СтрокаТаблицы из Объект.Предложения Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Предложение) тогда
			СтрокаТаблицы.ЕстьПредложение = 2;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ОтветКомпании) тогда
			СтрокаТаблицы.ЕстьОтвет = 2;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти 

#Область Управление_Доступностью

&НаСервере
Процедура УстановитьДоступностьРеквизитов();
	
	МассивНедоступныхДляРедатированияРеквизитов = ПолучитьЗапрещенныеРеквизиты();
	
	vftОбщиеПроцедурыДокументовСервер.УстановитьДоступностьРеквизитов(ЭтаФорма,МассивНедоступныхДляРедатированияРеквизитов,Истина);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗапрещенныеРеквизиты()
	
	Возврат	ПолучитьСоответствиеСтатусаИЗапрещенныхРеквизитов().Получить(Объект.Статус);
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеСтатусаИЗапрещенныхРеквизитов() Экспорт
	
	Соответствие = Новый Соответствие;  

	МассивВсеРеквизиты = vftОбщиеПроцедурыДокументовСервер.ПолучитьВсеЭлементыФормыДокумента(Объект,Ложь);
	
	Если ГлавныйУзел тогда
		
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Черновик	,МассивВсеРеквизиты);	
		
		МассивОтправлен = vftОбщиеПроцедурыДокументовСервер.СкопироватьМассивСтрок(МассивВсеРеквизиты,"#ОтветКомпании#ОтветКомпанииНаПредложение#");		
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Отправлен	,МассивОтправлен);
		
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Получен	,МассивВсеРеквизиты);
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Закрыт		,МассивВсеРеквизиты);

	Иначе
		
		МассивЧерновик = Новый Массив;
		МассивЧерновик.Добавить("ОтветКомпании");	
		МассивЧерновик.Добавить("ОтветКомпанииНаПредложение");	
		МассивЧерновик.Добавить("ОтветственныйКомпании");	
		МассивЧерновик.Добавить("Ответственный");
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Черновик	,МассивЧерновик);
		
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Отправлен	,МассивВсеРеквизиты);
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Получен	,МассивВсеРеквизиты);
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Закрыт		,МассивВсеРеквизиты);
		
	КонецЕсли;
	
	Возврат  Соответствие;
	
КонецФункции

&НаКлиенте
Процедура РазрешитьРедактированиеВсехРеквизитов(Команда)
	
РазрешитьРедактированиеВсехРеквизитовСервер();	

КонецПроцедуры

&НаСервере
Процедура РазрешитьРедактированиеВсехРеквизитовСервер()
	
vftОбщиеПроцедурыДокументовСервер.РазрешитьРедактированиеВсехРеквизитов(ЭтаФорма);	

КонецПроцедуры

#КонецОбласти

#Область Кнопки_Изменения_Статуса

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИзмененияСтатуса(Команда)
	
	Объект.Статус = vftОбщиеПроцедурыДокументовКлиент.ПолучитьСтатусПоИмениКоманды(Команда.Имя);
	
	/////rarus_rasuli_26.02.18 ++
	ИзменениеДатыПриСтатусеОтправлен();
	/////rarus_rasuli_26.02.18 --

КонецПроцедуры

&НаСервере
Функция ПолучитьВозможныеСтатусы() Экспорт
	
	Возврат vftОбщиеПроцедурыДокументовСервер.ПолучитьВозможныеСтатусы();
	
КонецФункции

/////rarus_rasuli_26.02.18 ++
 &НаСервере
Функция ИзменениеДатыПриСтатусеОтправлен() 
	
	Если Объект.Статус = Перечисления.vftСтатусыДокументовСообщений.Отправлен Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;	
	
КонецФункции
/////rarus_rasuli_26.02.18 --
#КонецОбласти
